app/controllers/resume_controller.rb

INSERT INTO "resumes" DEFAULT VALUES
---
  def save
    #puts params[:resume]
    @resume = Resume.new
    @resume.title = params[:resume]
    @resume.save