app/controllers/resume_controller.rb

 def create
    # puts "Made it to create"

    @resume = Resume.new(resume_params)
    if params[:resume][:resume_text].present?
      @resume.title = params[:resume][:resume_text]
    elsif params[:resume][:attachment].present?
      @resume.title = ' '
      # @pdf_reader = PDF::Reader.new(params[:resume][:attachment].tempfile.path)
      # @pdf_reader.pages.each do |page|
      #   @resume.title += page.text
      # end

      begin
        @pdf_reader = PDF::Reader.new(params[:resume][:attachment].tempfile.path)
        @pdf_reader.pages.each
        @pdf_reader.pages.each do |page|
          @resume.title += page.text #this works, i tested with puts
        end
      rescue PDF::Reader::MalformedPDFError => e
        flash[:error] = "Error parsing PDF: #{e.message}"
        redirect_to resume_path and return
      end

    else
      @resume.title = 'None, Error'
    end

    if @resume.save
---
SELECT "resumes".* FROM "resumes" ORDER BY "resumes"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "resumes" ("title", "created_at", "updated_at", "resume_text") VALUES (?, ?, ?, ?)  [["title", "Your resume text"], ["created_at", "2023-11-15 05:24:07.779440"], ["updated_at", "2023-11-15 05:24:07.779440"], ["resume_text", "Your resume text"]]

 def tailor

    @last_resume = Resume.last
    # flash[:notice] = @last_resume.title + 'hello'
    description = params[:description]

    if description == ""
      flash[:alert] = "Warning: you have not tailored your resume for editing or downloading"
      flash[:notice] = "No description, try again"
    else
      # flash[:alert] = "Success! You can preview or download"
      flash[:notice] = nil

      # Change resume with AI
      @prompt = "Tailor the following resume to match the job description. Don't lie, but rather enhance the resume to just fit the description better. Also, try to keep each line length roughly the same and the number of lines roughly the same from the original resume to the tailored resume. AGAIN, DO NOT JUST MAKE UP EXPERIENCES. :\n\nJob Description: #{description}\n\nResume: #{@last_resume.title} \n\nTailored Resume:"
      @tailored_resume = Gpt3Service.call(@prompt, 'gpt-3.5-turbo-0301')

      @last_resume.title = @tailored_resume.gsub('\n', "\n")
      @last_resume.resume_text = @tailored_resume.gsub('\n', "\n")
      @last_resume.save
---
SELECT "resumes".* FROM "resumes" ORDER BY "resumes"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "resumes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2023-11-01 21:45:24.208443"], ["updated_at", "2023-11-01 21:45:24.208443"]]
UPDATE "resumes" SET "title" = $1, "updated_at" = $2 WHERE "resumes"."id" = $3  [["title", "Skills: Java, Python (with experience in Ruby)"], ["updated_at", "2023-11-02 01:11:47.715217"], ["id", 42]]

def download
  tailored_resume = Resume.last
---
SELECT "resumes".* FROM "resumes" ORDER BY "resumes"."id" DESC LIMIT $1  [["LIMIT", 1]]

def editor
  @resume = Resume.last || Resume.new
---
SELECT "resumes".* FROM "resumes" ORDER BY "resumes"."id" DESC LIMIT $1  [["LIMIT", 1]]

def save
  @resume = Resume.last

  if @resume.update(resume_params)
---
SELECT "resumes".* FROM "resumes" ORDER BY "resumes"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "resumes" SET "resume_text" = ?, "updated_at" = ? WHERE "resumes"."id" = ?